[
  {
    "id": "5704727931913350269_0",
    "source_url": "https://tkrcet.ac.in/",
    "text": "TKR College Of Engineering & Technology EAMCET CODE : TKRC TKR College of Engineering and Technology – a modern temple of learning, an off shoot of the TKR Educational Society was established in the year 2002 in a sprawling, lush green 20 acre campus at Meerpet, Hyderabad. The college provides a serene and tranquil environment to the students, boosting their mental potential and preparing them in all aspects to face the cut- throat global competition with a smile on the face and emerge victorious. B.TECH IV SEM & III SEM REG & SUP TIME TABLES B.TECH I-II & I-I REGULAR AND SUPPLY NOTIFICATION B.TECH V SEM & VI SEM EXTERNAL TIME TABLE MAY-2025 B.TECH IV-I & IV-II SUPPLY NOTIFICATION May 2025 B.TECH III-I & III-II SUPPLY NOTIFICATION May2025 B.TECH III-II REGULAR NOTIFICATION MAY-2025 B.TECH I & II SEMESTER REGULAR/SUPPLY EXAMS JAN-2025 MBA II-I (R22) & II-II (R22,R20) Supply Exams Jan/Feb 2025 RC/RV last date: 26.04.2025 for Jan 2025 exams Tentative Eligible Student List for Grace Marks is out 2017, 2018, 2019 Batch - Results Declared B.Tech I Sem (R18 & R17) Supply Exams Time Tables Apr 2022 Grace Marks – ECE | CSE | ME | CE | EEE Exemption – ECE | CSE | ME | CE | EEE MBA II Yr I & II SEM Regular & Supply Notification JULY 2024 The newsletter which is being rolled out today marks the launch of an effervescent activity that would enable the management to bring out to the eyes of the competitive world, the academic achievements of our prestigious institution. Teegala Krishna Reddy Engineering College has grown in leaps and bounds, hurtling across barriers along the way. This has been made possible with the collaborative effort of the Management, the Staff and the Students. I congratulate everyone for their commitment. Engineers play the most vital and important role in nation building. They create new inventions using best engineered technologies to make human life more comfortable, secure and productive. In modern times, nations which have rich engineering and experienced management domains are flourishing economically and are providing better lives to their people We have excellent potential to grow in diversified areas and excel in Engineering and Management fields. We need enormous number of engineers and managers to write next story of success. The essence of Engineering and Management education which has spread in India is a very positive sign not only"
  },
  {
    "id": "5704727931913350269_1",
    "source_url": "https://tkrcet.ac.in/",
    "text": "make human life more comfortable, secure and productive. In modern times, nations which have rich engineering and experienced management domains are flourishing economically and are providing better lives to their people We have excellent potential to grow in diversified areas and excel in Engineering and Management fields. We need enormous number of engineers and managers to write next story of success. The essence of Engineering and Management education which has spread in India is a very positive sign not only to cater domestic needs but provide manpower to the entire world and become biggest technically trained community. TEEGALA KRISHNA REDDY EDUCATIONAL SOCIETY is a venture contributing to this Endeavour. We have started with full force to play a leading role in providing quality education and careers. We have identified the needs of modern engineering, technology and management education for modern age students, with a vision and mission accompanying transparency, accountability and accessibility which keeps us abreast and also ahead of our competitors. At the outset I send my greetings to the Editorial Board of TKRES Souvenir 2011, for working on a Magazine best in all aspects. We want to provide a complete package of educational services to TKRES students. I believe this magazine will provide us the benchmark for continued improvement in overall development of the College. This magazine should be a good source of guidance for faculty and coming batches of students in choosing activities of their choice in their future for building their careers. I appreciate the efforts of the Editorial team who have done an excellent job in compiling TKRES activities over the year and disseminate them through this Magazine as well as on the TKRES website. The motive of TKRES is to develop a global perspective to cope -up with the fast changing technology scenario. In addition to this, values with discipline are the hallmark of our college, besides, ensuring quality of the students; here the emphasis is not only on academic excellence but the development of the overall total personality of a student. To achieve this goal, add on courses, training in personality development, and other soft skills are also provided in our College. We take special care to ensure that new ideas are not merely discussed here but executed. Execution of new ideas helps the faculty and students to tread the path of ‘Innovation’ which is the slogan of our Institution. As excellence is"
  },
  {
    "id": "5704727931913350269_2",
    "source_url": "https://tkrcet.ac.in/",
    "text": "emphasis is not only on academic excellence but the development of the overall total personality of a student. To achieve this goal, add on courses, training in personality development, and other soft skills are also provided in our College. We take special care to ensure that new ideas are not merely discussed here but executed. Execution of new ideas helps the faculty and students to tread the path of ‘Innovation’ which is the slogan of our Institution. As excellence is the only criterion for selection of students, we are confident that in due course, promises will become ‘Achievements’ in their respective fields. I am delighted that TKRES has published the College Souvenir-2011. The Editorial Board has done a fair job to put up facts before students and parent community. To express one’s thought, College Magazine is the best platform and this is what our students have expressed in terms of contributions towards the magazine. I congratulate Editorial Board for unleashing the hidden potential of the students and making this Magazine a chapter of TKRES history. Dr. D. V. Ravi Shankar, Principal, TKR College of Engineering & Technology had obtained his AMIE from Institution of Engineers in the year 1987. He completed his M.Tech in Materials Engineering from Regional Engineering College (REC) presently NIT, Suratkal in the year 1994. He presented his M.Tech thesis paper at ISRO, Bangalore. He obtained is Ph.D in the branch of Mechanical Engineering in the year 2010 from JNT University, Hyderabad under the guidance of Dr.P. He has totally 23 years of experience which includes 7 years of Industrial experience and 16 years academic experience. Under his able guidance 35 Projects had completed in UG level, 10 Projects in PG Level and presently guiding 8 Projects in Ph.D Level. He has won gold medals for three successive years at 35th, 36th and 39th All India Level Design Competitions organized by National Design and Research Forum, The Institution of Engineers (India). TKRCET stands out as a premier institution committed to academic excellence, innovation, and holistic development. With state-of-the-art infrastructure, industry-aligned curriculum, and a strong focus on research and skill enhancement, the college ensures students are well-prepared for real-world challenges. Our exceptional placement record, dedicated faculty, and student-centric approach create an environment where talent thrives and futures are built. Join TKRCET to unlock your potential and step confidently into a successful career TKRCET is accredited with NAAC A+"
  },
  {
    "id": "5704727931913350269_3",
    "source_url": "https://tkrcet.ac.in/",
    "text": "Institution of Engineers (India). TKRCET stands out as a premier institution committed to academic excellence, innovation, and holistic development. With state-of-the-art infrastructure, industry-aligned curriculum, and a strong focus on research and skill enhancement, the college ensures students are well-prepared for real-world challenges. Our exceptional placement record, dedicated faculty, and student-centric approach create an environment where talent thrives and futures are built. Join TKRCET to unlock your potential and step confidently into a successful career TKRCET is accredited with NAAC A+ and NBA, approved by AICTE, and recognized under UGC 2(f) & 12(B)—ensuring quality education and institutional credibility. TKRCET is accredited with NAAC A+ and NBA, approved by AICTE, and recognized under UGC 2(f) & 12(B)—ensuring quality education and institutional credibility. The college has a dedicated Training & Placement Cell focused on achieving 100% placement, with continuous student training and company tie-ups. The campus is equipped with state-of-the-art laboratories, smart classrooms, Wi-Fi-enabled learning spaces, and digital libraries to support advanced learning. ft. Research & Development center, the college fosters innovation through MSME incubation, startup support, and funded research projects. TKRCET has established MoUs with ECIL and other industries, providing students with internship opportunities, industrial training, and real-world exposure. Offers add-on and bridge courses, mentorship programs, and personalized academic support—ensuring students thrive academically and professionally. Dear all ECE students of 2024 batch who have applied for Alcognito placement drive are hereby informed that the online test which was scheduled on 22nd June 2024 could not be conducted due to technical issues at the hiring organization end, so it was informed by the hiring organization the same online test is being rescheduled to 29th June 2024 from 10:00 A.M. onwards. So all the students please note the change and be prepared for the same. Minitech Floors Recruitment for B.Tech 2024 of Civil, EEE, ECE & Mech students, Company: Minitech Floors Last Date to Apply: 10th June 2024 Link to Apply: https://forms.gle/yUHUmM44zqar7Toa6 On campus drive by Hewlett Packard Enterprise (HPE) for B.Tech 2022 Batch only for Registered ECE / EEE / CSE / IT students on 28th Oct 2021 at 9AM TKRCET (K9) Auditorium (Pre – Placement Talk)-TPO. On campus drive by Kalyani Rafael Advanced Systems Pvt Ltd for B.Tech 2022/2023 Batch only for Registered ECE/EEE students on 27th Oct 2021 at 10AM in TKRCET(K9) Auditorium-TPO. TCS is hiring 2022 Batch B.Tech students of all branches with 60% and above throughout 10th, Intermediate, and"
  },
  {
    "id": "5704727931913350269_4",
    "source_url": "https://tkrcet.ac.in/",
    "text": "drive by Hewlett Packard Enterprise (HPE) for B.Tech 2022 Batch only for Registered ECE / EEE / CSE / IT students on 28th Oct 2021 at 9AM TKRCET (K9) Auditorium (Pre – Placement Talk)-TPO. On campus drive by Kalyani Rafael Advanced Systems Pvt Ltd for B.Tech 2022/2023 Batch only for Registered ECE/EEE students on 27th Oct 2021 at 10AM in TKRCET(K9) Auditorium-TPO. TCS is hiring 2022 Batch B.Tech students of all branches with 60% and above throughout 10th, Intermediate, and B.Tech. For full job description and application process, check the WhatsApp group PDF and apply through https://on.tcs.com/3rbqRLz. After checking the application status, fill this form: https://forms.gle/hLeZJNm93SxME1rCA. On campus drive by Formonic hiring for 2022 passed out B.Tech/Diploma Civil with 65% and above throughout education without any backlogs. Role: Trainee Eligibility: B.Tech/B.E/Diploma in Civil with 65% and above, no active backlogs. CTC: INR 1.8 Lakh PA Registration Link: https://forms.gle/9dQ8ExwuG8jSMFMf7 Last Date to Apply: 23rd July 2021 (3:00 PM) Placement Drive: 27th July 2021 Reporting Time: 9:00 AM Selection Process: • Written Test (Isometric & Orthographic drawings) at college • Face-to-face round at company premises Note: Carry pencil, sharpener, drafter, scale, eraser. Bring 2 resumes & 2 photos. CtrlS online test for B.Tech 2021 passouts: EEE / CE / Mech – 75% & EAMCET rank < 20,000 CSE / IT / ECE – 75% & EAMCET rank < 15,000 Drive Date: 30/12/2020 Salary: 3.75 LPA – TPO Congratulations to the B.Tech 2020–2021 Batch TCS selected students. CtrlS hiring for B.Tech 2021 passouts in EEE/CE/MECH/CSE/IT/ECE. Register at https://forms.gle/LXrrQSqv5TYMtcjP9 by 23/12/20, 1PM. Savantis Solutions hired 127 students in a placement drive for HCL Technologies with a package of 2.8 LPA. Congratulations to all 40 final selected students of 2021 Batch in Cognizant with 4 LPA CTC. Congratulations to all 4 selected students of 2021 Batch in ENHISecure with 3.91 LPA CTC. Accenture hiring B.Tech 2020 graduates of all branches with 65% without backlogs. On campus drive by ZenQ for B.Tech 2021 (CSE/IT/ECE/EEE/MECH) with 70%. Register at https://bit.ly/3qRDOcS before 14/12/20, 12 PM. ENHiSecure shortlisted students – further rounds on 10th & 11th Dec 2020 (9:30 AM to 12 PM). Check your email for the time slot – TPO. Wipro Elite hiring B.Tech 2021 (ECE/EEE/CSE/IT) with 65% in B.Tech and 60% in 10th/12th. On-campus drive by Medico Inc for B.Tech (ECE/EEE/CSE/IT) & B.Pharma (2019–2021) on 09th Dec 2020. Congratulations to all 87 students shortlisted in Cognizant"
  },
  {
    "id": "5704727931913350269_5",
    "source_url": "https://tkrcet.ac.in/",
    "text": "campus drive by ZenQ for B.Tech 2021 (CSE/IT/ECE/EEE/MECH) with 70%. Register at https://bit.ly/3qRDOcS before 14/12/20, 12 PM. ENHiSecure shortlisted students – further rounds on 10th & 11th Dec 2020 (9:30 AM to 12 PM). Check your email for the time slot – TPO. Wipro Elite hiring B.Tech 2021 (ECE/EEE/CSE/IT) with 65% in B.Tech and 60% in 10th/12th. On-campus drive by Medico Inc for B.Tech (ECE/EEE/CSE/IT) & B.Pharma (2019–2021) on 09th Dec 2020. Congratulations to all 87 students shortlisted in Cognizant online test held on 18th/19th October 2020. CSE – 27 ECE – 37 EEE – 10 IT – 8 MECH – 5 Total – 87 COGNIZANT shortlisted students – interviews on 26/11/20 (7AM–7PM). ENHiSecure On-Campus drive for B.Tech 2021 (ECE/CSE/IT) on 19-11-2020 at 9 AM. Online Tests: 24th, 25th & 26th Oct 2020. On-campus drive by Erwin for B.Tech 2020 (ECE/CSE/IT) with 68% on 25-02-2020 in TKRCET Auditorium. Positions: • Trainee Software Engineer (Java) • Trainee Software Engineer (C++) • Trainee Test Engineer On-campus drive by RAAM Group on 06-02-2020 for B.Tech 2020 (all branches) & Diploma (MECH only) with 55% at 9:30 AM. NNIT selected students must meet TPO on 06-02-2020 at 10:30 AM in TPO Cell – TKRCET K9. On-campus drive by NNIT on 30/01/2020 for B.Tech 2020 (all branches) & MBA. Off-campus drive by DXC Technology via CoCubes on 28/01/2020 for 2020 Batch (all branches with 65%). On-campus drive by Vertafore on 27/01/2020 for 2020 Batch (CSE/IT) with 65%. Dear all ECE students of 2024 batch who have applied for Alcognito placement drive are hereby informed that the online test which was scheduled on 22nd June 2024 could not be conducted due to technical issues at the hiring organization end, so it was informed by the hiring organization the same online test is being rescheduled to 29th June 2024 from 10:00 A.M. onwards. So all the students please note the change and be prepared for the same. Minitech Floors Recruitment for B.Tech 2024 of civil, EEE,ECE & Mech students, Company: Minitech Floors Late Date to apply:10th June 24 Link to Apply: https://forms.gle/yUHUmM44zqar7Toa6, make this text code moves automatic scroll animation bottom to top in code On campus drive by Hewlett Packard Enterprise (HPE) for B.Tech 2022 Batch only for Registered ECE / EEE / CSE / IT students on 28th Oct 2021 at 9AM TKRCET (K9) Auditorium (Pre – Placement Talk)-TPO On campus drive by Kalyani Rafael"
  },
  {
    "id": "5704727931913350269_6",
    "source_url": "https://tkrcet.ac.in/",
    "text": "Minitech Floors Recruitment for B.Tech 2024 of civil, EEE,ECE & Mech students, Company: Minitech Floors Late Date to apply:10th June 24 Link to Apply: https://forms.gle/yUHUmM44zqar7Toa6, make this text code moves automatic scroll animation bottom to top in code On campus drive by Hewlett Packard Enterprise (HPE) for B.Tech 2022 Batch only for Registered ECE / EEE / CSE / IT students on 28th Oct 2021 at 9AM TKRCET (K9) Auditorium (Pre – Placement Talk)-TPO On campus drive by Kalyani Rafael Advanced Systems Pvt Ltd for B.Tech 2022/2023 Batch only for Registered ECE/EEE students on 27th Oct 2021 at 10AM in TKRCET(K9) Auditorium-TPO. TCS is hiring 2022 batch students B.Tech of all branches with 60% and above throughout 10th, Intermediate and B.Tech. For full Job description and application process, please go through the pdf attachment thoroughly in whatapp group and apply through link to https://on.tcs.com/3rbqRLz for this drive… After checking the application status, fill the below google form without fail: https://forms.gle/hLeZJNm93SxME1rCA . On campus drive by Formonic hiring for 2022 passed out B.Tech/Diploma CIVIL with 65% and above throughout education without any backlogs. (For complete information check the JD attached) Role: Trainee Eligibility: B.Tech/B.E/Diploma in Civil with 65% and above no active backlogs. CTC: INR 1.8 Lakh PA. (Based on performance and qualification salary will be revised after 1 year) Registration Links: https://forms.gle/9dQ8ExwuG8jSMFMf7 Last Date to Apply: – 23rd July 2021 by 03:00 P.M. Placement Drive date: – 27th July, 2021. Reporting Time: 9:00 AM Selection Process: • Written Test (Written test will be on Isometric and Orthographic Views and drawings)( At College Premises) • Face 2 face round (Will be at Company Premises) *Note:* • All the Candidates should carry A Pencil. Sharpener, Drafter, Scale, Eraser of their own. • Students need to carry 2 Sets of Updated Resume & 2 Pass Photographs CtrlS online test for for B.Tech 2021 passouts of EEE / CE / MECH with 75% & EAMCET rank below 20,000 and CSE,IT, ECE with 75% and Eamcet rank below 15000 for Graduate Engineer role, today 30/12/2020. SAL.3.75-TPO Congratulations to the B.Tech 2020-2021 Batch TCS selected students. CtrlS hiring for B.Tech 2021 passouts of EEE/CE/MECH with 75% & EAMCET rank below 20,000 and CSE,IT,ECE with 75% and Eamcet rank below 15000 for Graduate Engineer role. Register with link https://forms.gle/LXrrQSqv5TYMtcjP9 by today 23/12/20 1PM.SAL.3.75-TPO. Savantis Solutions hired 127 students in a placement drive for HCL Technologies with a"
  },
  {
    "id": "5704727931913350269_7",
    "source_url": "https://tkrcet.ac.in/",
    "text": "EAMCET rank below 20,000 and CSE,IT, ECE with 75% and Eamcet rank below 15000 for Graduate Engineer role, today 30/12/2020. SAL.3.75-TPO Congratulations to the B.Tech 2020-2021 Batch TCS selected students. CtrlS hiring for B.Tech 2021 passouts of EEE/CE/MECH with 75% & EAMCET rank below 20,000 and CSE,IT,ECE with 75% and Eamcet rank below 15000 for Graduate Engineer role. Register with link https://forms.gle/LXrrQSqv5TYMtcjP9 by today 23/12/20 1PM.SAL.3.75-TPO. Savantis Solutions hired 127 students in a placement drive for HCL Technologies with a pay package of INR 2.8 LPA. Congratulations to the all 40 final selected students 2021 Batch in COGNIZANT with 4 LPA. CTC Congratulations to the all 4 final selected students 2021 Batch in ENHISecure with 3.91 LPA. CTC Accenture hiring for B.Tech 2020 graduates of All branches with 65% without Backlogs. Register with Link https://accntu.re/3a5m4VE TPO On campus drive by ZenQ for B.Tech 2021(CSE, IT, ECE, EEE & MECH) with 70%. Register with Link https://bit.ly/3qRDOcS before 14/12/20 by 12:00 P.M. SAL.2.8LPA ENHiSecure shortlisted students are informed that the further rounds will be on 10th & 11th Dec 2020 in their office premise From( 9:30AM to 12Noon Time slot). Kindly check your mail for Guidelines and Exact time slot-TPO Wipro Elite hiring for B.Tech.2021 for ECE / EEE / CSE / IT with (B.Tech 65% & in 10th / 12th – 60%) for Project Engineer. Reg in link https://bit.ly/3gy5Zcc ON Campus drive by MEDICO INC For B.Tech ECE / EEE / CSE / IT & B.PHARMA FOR (2019 TO 2021) 09th DEC, 2020 Congratulations to all 87 students for getting shortlisted in COGNIZANT online test held on 18th/19th /Oct 20. Branch Shortlisted All the COGNIZANT shortlisted students are informed that further rounds (interview) is scheduled tomorrow (26/11/20) from 7AM to 7PM & information for time will be getting 1 hour prior. Hence keep ready your all digital copies & keep checking your mail. ENHiSecure On campus drive for B. Tech 2021 Batch students of ECE / CSE / IT. Online test on 24th 25th & 26th Oct 2020. Online test on 18th Oct 2020. Opportunities for 2021 batch students On campus drive by Erwin for B.Tech 2020 of ECE / CSE / IT with 68% on 25-02-2020 in TKRCET Auditorium. Regester in below link by 24-02-2020 by 5pm Trainee Software Engineer(Java) Trainee Software Engineer (C++) Trainee Test Engineer .TPO On Campus drive by RAAM GROUP tomorrow 06-02-2020 for B.Tech 2020, of"
  },
  {
    "id": "5704727931913350269_8",
    "source_url": "https://tkrcet.ac.in/",
    "text": "Batch students of ECE / CSE / IT. Online test on 24th 25th & 26th Oct 2020. Online test on 18th Oct 2020. Opportunities for 2021 batch students On campus drive by Erwin for B.Tech 2020 of ECE / CSE / IT with 68% on 25-02-2020 in TKRCET Auditorium. Regester in below link by 24-02-2020 by 5pm Trainee Software Engineer(Java) Trainee Software Engineer (C++) Trainee Test Engineer .TPO On Campus drive by RAAM GROUP tomorrow 06-02-2020 for B.Tech 2020, of all branches & (Dip.MECH ONLY) with 55% at 9:30AM in TKRCET Auditorium.SAL-2.4LPA. Carry your Resume – TPO All the NNIT selected students are inform to meet TPO sir tomorrow 06-02-2020 in TKRCET (K9) TPO cell at 10:30 AM sharp without fail – TPO. On campus drive by NNIIT on 30/1/20 for B.Tech 2020, of all branches & MBA. Reg in below link immediately NNIIT by 5PM to attend 30/1/2020 drive .SAL.7LPA.TPO Off campus drive by DXC Technology by Cocubes on 28/1/20 fr 2020 Batch, of All branches with 65%. Reg with link DXC Technology before 24/1/20 by 3PM.Venue will be informed directly to Reg students.SAL.3.4LPA-TPO On campus drive by Vertafore on 27/1/20 for 2020 Batch, of CSE/IT with 65%.Reg with link Vertafore before 22/1/20 by 1PM. After 1PM no applications will be accepted SAL.3LPA-TPO Discover the vibrant campus life, cutting-edge infrastructure, and academic excellence at TKRCET. This video offers a glimpse into our commitment to nurturing future leaders through innovation, knowledge, and holistic development. Join us in shaping a brighter tomorrow."
  },
  {
    "id": "4657704445426866311_0",
    "source_url": "https://tkrcet.ac.in/vision-mission/",
    "text": "Vision & Mission - Vision & Mission Vision The Institution endeavours towards imparting quality education with ethical values and strives to make students technically competent to reach heights and make our nation self-reliant and globally recognized The institution aspires to be a center of excellence in engineering and technology education. Our vision is to: Impart high-quality education that blends academic excellence with ethical values. Nurture technically competent graduates who are capable of addressing real-world challenges with innovative solutions. Promote leadership and professionalism in every student to foster a spirit of responsibility and service. Encourage lifelong learning through continuous development and skill enhancement. Strive for national self-reliance by preparing students to contribute effectively to India’s growth in science and technology. Gain global recognition by producing industry-ready professionals equipped with global competencies. Mission The Institution is committed and dedicated to mould the students into quality engineers and technologists with aplomb by providing world-class scientific and technical education through: - Ensuring excellent branch wise infrastructural facilities with eminent and qualified faculty - Making the institute a research/resource centre to enhance scope for consultancy and R&D Our mission is to cultivate a dynamic learning environment that transforms students into capable engineers and responsible citizens. To achieve this, we are committed to: - Providing World-Class Technical Education: Delivering comprehensive programs across all disciplines through a curriculum that is aligned with industry needs and emerging technologies. - Ensuring State-of-the-Art Infrastructure: Maintaining modern laboratories, libraries, and computing facilities to support both teaching and research activities in every department. - Employing Eminent and Qualified Faculty: Engaging experienced educators and researchers to mentor students and promote academic excellence. - Promoting Ethical and Professional Values: Instilling a strong sense of ethics, discipline, and responsibility among students to prepare them for societal and professional roles. - Encouraging Innovation and Research: Fostering a research-centric atmosphere that encourages students and faculty to undertake projects with practical and social relevance. - Establishing Industry Partnerships: Collaborating with leading industries to enhance learning through internships, guest lectures, and joint research opportunities. - Becoming a Hub for R&D and Consultancy: Positioning the institute as a recognized resource center for advanced research, development, and consultancy services. - Supporting Holistic Student Development: Offering extracurricular and co-curricular activities to shape well-rounded individuals with leadership and communication skills. - Campus Resources - Student Degree Verification - New Student Registration - Income Declaration Form (2024-25) - NCC - NSS - SOP -"
  },
  {
    "id": "4657704445426866311_1",
    "source_url": "https://tkrcet.ac.in/vision-mission/",
    "text": "Collaborating with leading industries to enhance learning through internships, guest lectures, and joint research opportunities. - Becoming a Hub for R&D and Consultancy: Positioning the institute as a recognized resource center for advanced research, development, and consultancy services. - Supporting Holistic Student Development: Offering extracurricular and co-curricular activities to shape well-rounded individuals with leadership and communication skills. - Campus Resources - Student Degree Verification - New Student Registration - Income Declaration Form (2024-25) - NCC - NSS - SOP - Achievements - Good Governance Document - Strategic Plan & Program Development Document - Research Policy Document - Ombudsperson - Route Map - Virtual Tour 360 - Service Rules - Online Grievance Cell - B Category / Management Application Form - Feedback(s) - Mandatory Disclosures - Code-of-Conduct - Home"
  },
  {
    "id": "220786201650761446_0",
    "source_url": "https://tkrcet.ac.in/about-the-campus/",
    "text": "About The Campus - Home - About The Campus About The Campus TKR College of Engineering and Technology – a modern temple of learning, an off shoot of the TKR Educational Society was established in the year 2002 in a sprawling, lush green 20 acre campus at Meerpet, Hyderabad. The college provides a serene and tranquil environment to the students, boosting their mental potential and preparing them in all aspects to face the cut- throat global competition with a smile on the face and emerge victorious. Sri Teegala Krishna Reddy, the Mayor of Hyderabad, is the founder chairman of TKR Educational Society. A Philanthropist by nature, “the friend of man, to vice alone of foe”, and an urge to see our students excelling themselves in all fields prompted him to start the educational society; making it easy for education to be within arm’s length of even a rural student and providing them with an independent and easy in the for pursuing their dreams and making them come true and in the process upholding moral and ethical values. The person puts in all his efforts to see the students excelling themselves and takes great pride in watching them carve out a niche for themselves is none other than Dr.T.Harinath Reddy, the Secretary of the college. A calm and serene countenance with sharp, twinkling eyes, he is the pivotal of encouragement and is always on the look out for avenues, which would provide the wherewithal for developing a cutting edge to their capabilities and potentialities. The college is headed by eminent principal Dr. D. V. Ravi Shankar. He obtained his AMIE in Mechanical Engineering, M.Tech and Ph.D from JNT University, Hyderabad. He published various research papers in national and international journals. The College is affiliated to Jawaharlal Nehru Technological University Kukatpally, Hyderabd. It has been approved by AICTE, New Delhi and the State Government of Telangana and has been sanctioned seven UG courses – Civil Engineering, Electrical & Electronics Engineering, Computer Science & Engineering, Electronics & Communication Engineering, Mechanical Engineering and PG Courses – M.Tech in CSE, PE & MBA. In addition the College is running second shift Polytechnic in the branches – CIVIL, EEE, MECH, ECE & CSE. - Campus Resources - Student Degree Verification - New Student Registration - Income Declaration Form (2024-25) - NCC - NSS - SOP - Achievements - Good Governance Document - Strategic Plan & Program"
  },
  {
    "id": "220786201650761446_1",
    "source_url": "https://tkrcet.ac.in/about-the-campus/",
    "text": "courses – Civil Engineering, Electrical & Electronics Engineering, Computer Science & Engineering, Electronics & Communication Engineering, Mechanical Engineering and PG Courses – M.Tech in CSE, PE & MBA. In addition the College is running second shift Polytechnic in the branches – CIVIL, EEE, MECH, ECE & CSE. - Campus Resources - Student Degree Verification - New Student Registration - Income Declaration Form (2024-25) - NCC - NSS - SOP - Achievements - Good Governance Document - Strategic Plan & Program Development Document - Research Policy Document - Ombudsperson - Route Map - Virtual Tour 360 - Service Rules - Online Grievance Cell - B Category / Management Application Form - Feedback(s) - Mandatory Disclosures - Code-of-Conduct - Home"
  },
  {
    "id": "8816674693565320727_0",
    "source_url": "https://tkrcet.ac.in/chairmans-message/",
    "text": "Chairman’s Message - Chairman’s Message Chairman’s Message Teegala Krishna Reddy TKR Educational Society was established in 2001, it is reputedly academic oriented. Teegala Krishna Reddy, the former mayor of Hyderabad and leader of masses is the Chairman of the society. A native of Meerpet Village with challenging experiences in the process of emerged into a reputed educationalist with a laudable ambition of spreading education to meet the educational needs of the aspirant youth. Under his dynamic and creative chairmanship, the TKR Educational institutions for the prospective future of aspiring youth for the purpose of serving A.P State in particular and our country in general. These premier educational institutions are TKR College of Engineering and Technology established in 2002, Teegala Krishna Reddy College of Engineering established in 2005, TKR Institute of Management and Science established in 2003, and TKR College of Pharmacy established in 2007, in a speawling area of 30 acres. TKRCET and TKREC are affiliated to JNTU and approved by AICTE. TKRCOP is affiliated to JNTU and approved by AICTE. TKRCOP is affiliated to JNTU and approved by PCI. TKRIMS is affiliated to OU and approved by AICTE. These institutions impart the latest knowledge in Technology, Management and Pharmacy to create global leaders. With boundless and boundary-less creativity and a highly committed, the TKR Educational Society has been consistently shaping intellects capable of integrating the contemporary knowledge with classic values through its institutions, since the philosophy of TKRES is to achieve excellence both in academic and non-academic areas with an incessant pursuit of accomplishing milestones. TKR College of Engineering and Technology – a modern temple of learning, an off shoot of the TKR Educational Society was established in the year 2002 in a sprawling, lush green 20 acre campus at Meerpet, Hyderabad. The college provides a serene and tranquil environment to the students, boosting their mental potential and preparing them in all aspects to face the cut- throat global competition with a smile on the face and emerge victorious. Dr. T. Harinath Reddy, a Physician, is the Honorable Secretary of the TKR Educational Society and Mr. T. Amarnath Reddy, a Management graduate is the Honorable Treasurer of the Society, who are endowed with administrative and managerial skills. - Campus Resources - Student Degree Verification - New Student Registration - Income Declaration Form (2024-25) - NCC - NSS - SOP - Achievements - Good Governance Document - Strategic Plan &"
  },
  {
    "id": "8816674693565320727_1",
    "source_url": "https://tkrcet.ac.in/chairmans-message/",
    "text": "competition with a smile on the face and emerge victorious. Dr. T. Harinath Reddy, a Physician, is the Honorable Secretary of the TKR Educational Society and Mr. T. Amarnath Reddy, a Management graduate is the Honorable Treasurer of the Society, who are endowed with administrative and managerial skills. - Campus Resources - Student Degree Verification - New Student Registration - Income Declaration Form (2024-25) - NCC - NSS - SOP - Achievements - Good Governance Document - Strategic Plan & Program Development Document - Research Policy Document - Ombudsperson - Route Map - Virtual Tour 360 - Service Rules - Online Grievance Cell - B Category / Management Application Form - Feedback(s) - Mandatory Disclosures - Code-of-Conduct - Home"
  },
  {
    "id": "1908980902185475829_0",
    "source_url": "https://tkrcet.ac.in/secretarys-message/",
    "text": "Secretary’s Message - Secretary’s Message Secretary’s Message Dr. T. Harinath Reddy Engineers play the most vital and important role in nation building. They create new inventions using best engineered technologies to make human life more comfortable, secure and productive. In modern times, nations which have rich engineering and experienced management domains are flourishing economically and are providing better lives to their people We have excellent potential to grow in diversified areas and excel in Engineering and Management fields. We need enormous number of engineers and managers to write next story of success. The essence of Engineering and Management education which has spread in India is a very positive sign not only to cater domestic needs but provide manpower to the entire world and become biggest technically trained community. TEEGALA KRISHNA REDDY EDUCATIONAL SOCIETY is a venture contributing to this Endeavour. We have started with full force to play a leading role in providing quality education and careers. We have identified the needs of modern engineering, technology and management education for modern age students, with a vision and mission accompanying transparency, accountability and accessibility which keeps us abreast and also ahead of our competitors. At the outset I send my greetings to the Editorial Board of TKRES Souvenir 2011, for working on a Magazine best in all aspects. We want to provide a complete package of educational services to TKRES students. I believe this magazine will provide us the benchmark for continued improvement in overall development of the College. This magazine should be a good source of guidance for faculty and coming batches of students in choosing activities of their choice in their future for building their careers. I appreciate the efforts of the Editorial team who have done an excellent job in compiling TKRES activities over the year and disseminate them through this Magazine as well as on the TKRES website. - Campus Resources - Student Degree Verification - New Student Registration - Income Declaration Form (2024-25) - NCC - NSS - SOP - Achievements - Good Governance Document - Strategic Plan & Program Development Document - Research Policy Document - Ombudsperson - Route Map - Virtual Tour 360 - Service Rules - Online Grievance Cell - B Category / Management Application Form - Feedback(s) - Mandatory Disclosures - Code-of-Conduct - Home"
  },
  {
    "id": "1908980902185475829_1",
    "source_url": "https://tkrcet.ac.in/secretarys-message/",
    "text": "Student Registration - Income Declaration Form (2024-25) - NCC - NSS - SOP - Achievements - Good Governance Document - Strategic Plan & Program Development Document - Research Policy Document - Ombudsperson - Route Map - Virtual Tour 360 - Service Rules - Online Grievance Cell - B Category / Management Application Form - Feedback(s) - Mandatory Disclosures - Code-of-Conduct - Home"
  },
  {
    "id": "4204524278924367933_0",
    "source_url": "https://tkrcet.ac.in/treasurers-message/",
    "text": "Treasurer’s Message - Treasurer’s Message Treasurer’s Message Sri. T. Amarnath Reddy The motive of TKRES is to develop a global perspective to cope -up with the fast changing technology scenario. In addition to this, values with discipline are the hallmark of our college, besides, ensuring quality of the students; here the emphasis is not only on academic excellence but the development of the overall total personality of a student. To achieve this goal, add on courses, training in personality development, and other soft skills are also provided in our College. We take special care to ensure that new ideas are not merely discussed here but executed. Execution of new ideas helps the faculty and students to tread the path of ‘Innovation’ which is the slogan of our Institution. As excellence is the only criterion for selection of students, we are confident that in due course, promises will become ‘Achievements’ in their respective fields. I am delighted that TKRES has published the College Souvenir-2011. The Editorial Board has done a fair job to put up facts before students and parent community. To express one’s thought, College Magazine is the best platform and this is what our students have expressed in terms of contributions towards the magazine. I congratulate Editorial Board for unleashing the hidden potential of the students and making this Magazine a chapter of TKRES history. - Campus Resources - Student Degree Verification - New Student Registration - Income Declaration Form (2024-25) - NCC - NSS - SOP - Achievements - Good Governance Document - Strategic Plan & Program Development Document - Research Policy Document - Ombudsperson - Route Map - Virtual Tour 360 - Service Rules - Online Grievance Cell - B Category / Management Application Form - Feedback(s) - Mandatory Disclosures - Code-of-Conduct - Home"
  },
  {
    "id": "6107093380895515417_0",
    "source_url": "https://tkrcet.ac.in/principal/",
    "text": "Principal’s Profile - Principal’s Profile Principal’s Profile Dr. D. V. Ravi Shankar Dr. D. V. Ravi Shankar, Principal, TKR College of Engineering & Technology had obtained his AMIE from Institution of Engineers in the year 1987. He completed his M.Tech in Materials Engineering from Regional Engineering College (REC) presently NIT, Suratkal in the year 1994. He presented his M.Tech thesis paper at ISRO, Bangalore. He obtained is Ph.D in the branch of Mechanical Engineering in the year 2010 from JNT University, Hyderabad under the guidance of Dr. P. Rami Reddy, former Registrar, JNTUH. He has totally 23 years of experience which includes 7 years of Industrial experience and 16 years academic experience. Under his able guidance 35 Projects had completed in UG level, 10 Projects in PG Level and presently guiding 8 Projects in Ph.D Level. He has won gold medals for three successive years at 35th, 36th and 39th All India Level Design Competitions organized by National Design and Research Forum, The Institution of Engineers (India). - Campus Resources - Student Degree Verification - New Student Registration - Income Declaration Form (2024-25) - NCC - NSS - SOP - Achievements - Good Governance Document - Strategic Plan & Program Development Document - Research Policy Document - Ombudsperson - Route Map - Virtual Tour 360 - Service Rules - Online Grievance Cell - B Category / Management Application Form - Feedback(s) - Mandatory Disclosures - Code-of-Conduct - Home"
  },
  {
    "id": "6219279581974245200_0",
    "source_url": "https://tkrcet.ac.in/vice-principal/",
    "text": "Vice-Principal - Vice-Principal Vice-Principal Profile Dr. A. Suresh Rao Dr. A. Suresh Rao, is a Professor in the Department of Computer Science & Engineering and was conferred with the PhD Degree in Computer Science & Engineering from NIT Warangal, in the year 2015. He is currently the Vice Principal, Dean of Academics and Head of the Department of Computer Science and Engineering at TKRCET. His experience spans across a period of 20 years; 02 years in the Industry and 18 Years in Teaching. Apart from teaching he is also a discerning administrator. Under his guidance more than 40 students have undergone project training at UG level and 20 students at PG level. Two batches of students have won 3rd prize in Smart India Hackathon 2017. He has 15 International and National Publications to his credit. He provides consultancy for various Government Bodies and Private firms in developing the required software for their automation, and also holds one patent in publishing state. - Campus Resources - Student Degree Verification - New Student Registration - Income Declaration Form (2024-25) - NCC - NSS - SOP - Achievements - Good Governance Document - Strategic Plan & Program Development Document - Research Policy Document - Ombudsperson - Route Map - Virtual Tour 360 - Service Rules - Online Grievance Cell - B Category / Management Application Form - Feedback(s) - Mandatory Disclosures - Code-of-Conduct - Home"
  },
  {
    "id": "3955568866736264351_0",
    "source_url": "https://tkrcet.ac.in/admission-procedure/",
    "text": "Admission Procedure - Admission Procedure B Tech Programmes The Eligibility Criteria for Admission to B.Tech Programme: Admissions to the Institute are made along with the other Engineering colleges in the state through a common entrance test (EAMCET) conducted by the Govt. Tech is as follows: The minimum qualification for admission to first year of the B. Tech course is a pass in the Intermediate (10 + 2) conducted by the board of Intermediate education, Govt. of Telangana State or any other examination recognized as equivalent thereto with Mathematics, Physics and Chemistry as optional subjects. 70 % of the seats are allotted based on the merit in the EAMCET. 30 % of the seats are earmarked for Management/NRI candidates. In addition to the above, Diploma holders are admitted in second year of B. Tech to the extent of 10% of intake based on the merit in the ECET, under lateral entry scheme. M Tech Programmes The Eligibility Criteria for Admission to M.Tech Programme : Non Sponsored Candidates must have a B.E / B.Tech Degree or its equivalent from AICTE approved Institutions and a valid GATE score/ PGECET Rank. Sponsored Candidates must have a minimum B.E / B.Tech Degree or its equivalent from AICTE approved Institutions with a minimum of 55% marks in aggregate.The candidate must have a minimum two years of full time work experience in a recognized firm / industry / Company / Educational or Research Institution / Any Department of Government / Autonomous organization in the relevant field in which admission is being sought. A letter from the employer must be furnished stating that the candidate is being sponsored to get admission. The employer should also indicate that the candidate will not be withdrawn, midway till the completion of the programme ADMISSION Admission will be made through GATE, by the convenor PGECET. When GATE Candidates are not available, admission will be given to PGECET qualified candidates on merit basis. Admission for Sponsored category will be made based on merit. Preference will be given to GATE qualified candidates. Diploma - Campus Resources - Student Degree Verification - New Student Registration - Income Declaration Form (2024-25) - NCC - NSS - SOP - Achievements - Good Governance Document - Strategic Plan & Program Development Document - Research Policy Document - Ombudsperson - Route Map - Virtual Tour 360 - Service Rules - Online Grievance Cell - B Category / Management Application"
  },
  {
    "id": "3955568866736264351_1",
    "source_url": "https://tkrcet.ac.in/admission-procedure/",
    "text": "Admission for Sponsored category will be made based on merit. Preference will be given to GATE qualified candidates. Diploma - Campus Resources - Student Degree Verification - New Student Registration - Income Declaration Form (2024-25) - NCC - NSS - SOP - Achievements - Good Governance Document - Strategic Plan & Program Development Document - Research Policy Document - Ombudsperson - Route Map - Virtual Tour 360 - Service Rules - Online Grievance Cell - B Category / Management Application Form - Feedback(s) - Mandatory Disclosures - Code-of-Conduct - Home"
  },
  {
    "id": "7089655702407029880_0",
    "source_url": "https://tkrcet.ac.in/fee-structure/",
    "text": "Fee Structure - Fee Structure Fee Structure A recent PDF on TKRCET’s site provides specific fee information for SC, ST & Minority categories First Year UG/B.Tech: ₹ 85,000 Second, Third & Fourth Year UG/B.Tech: ₹ 70,000 annually MBA (SC/ST/Minority): ₹ 45,000 Mandatory Disclosure (Amendment for AY 2021–22) | Category | First Year Fee | Later Year Fee | |---|---|---| | UG/B.Tech (SC/ST/Minority) | ₹ 85,000 | ₹ 70,000 | | MBA (SC/ST/Minority) | ₹ 45,000 | — | - Campus Resources - Student Degree Verification - New Student Registration - Income Declaration Form (2024-25) - NCC - NSS - SOP - Achievements - Good Governance Document - Strategic Plan & Program Development Document - Research Policy Document - Ombudsperson - Route Map - Virtual Tour 360 - Service Rules - Online Grievance Cell - B Category / Management Application Form - Feedback(s) - Mandatory Disclosures - Code-of-Conduct - Home"
  },
  {
    "id": "1021784718618014841_0",
    "source_url": "https://tkrcet.ac.in/computer-science-and-engineering/",
    "text": "Computer Science and Engineering - Computer Science and Engineering Computer Science and Engineering The Department of Computer Science and Engineering (CSE) was established in 2002 with the goal of delivering integrated technology education to students from all across India and the world, thereby developing responsible citizens who would contribute to the advancement of their families, community, and nation. Under the dynamic guidance of Dr. A. Suresh Rao, the department is experiencing a moment of tremendous development and potential driven by the advancement of technology and its recognition. Dr. A. Suresh Rao, is a Professor in the Department of Computer Science & Engineering and was conferred with the PhD Degree in Computer Science & Engineering from NIT Warangal, in the year 2014. He is currently the Vice Principal, Dean of Academics and Head of the Department of Computer Science and Engineering at TKRCET. His experience spans across a period of 22 years; 02 years in the Industry and 20 Years in Teaching. Apart from teaching he is also a discerning administrator. Under his guidance more than 40 students have undergone project training at UG level and 20 students at PG level. Two batches of students have won 3rd prize in Smart India Hackathon Contest. He has 22 International and National Publications to his credit. He provides consultancy for various Government Bodies and Private firms in developing the required software for their automation, and also holds a patent in granted. | COURSE | SPECIALIZATION | CATEGORY | DURATION | TYPE | INTAKE | |---|---|---|---|---|---|---| | 1 | B.TECH | Computer Science and Engineering | UNDER GRADUATE | 4 YEARS | FULL TIME | 420 | | 2 | M.TECH | Computer Science and Engineering | POST GRADUATE | 2 YEARS | FULL TIME | 24 | - VISION - MISSION - PO's - PSO's - PEO's The department aims to mould the students into ethically responsible professionals having computational thinking, entrepreneurial traits and technical knowledge to conceive, design and deploy reliable computing systems for modern industry and to offer self-reliant services in research, academic arenas of science, society and technology. M1: Strengthening the core competence in Computer Science and Engineering through analytical learning and Industry – Institute interaction. M2: Providing exposure to latest tools and technologies in the core area to design solutions and conduct investigations. M3: Promoting innovative research based projects / activities in the emerging areas of technology convergence. M4:"
  },
  {
    "id": "1021784718618014841_1",
    "source_url": "https://tkrcet.ac.in/computer-science-and-engineering/",
    "text": "and technical knowledge to conceive, design and deploy reliable computing systems for modern industry and to offer self-reliant services in research, academic arenas of science, society and technology. M1: Strengthening the core competence in Computer Science and Engineering through analytical learning and Industry – Institute interaction. M2: Providing exposure to latest tools and technologies in the core area to design solutions and conduct investigations. M3: Promoting innovative research based projects / activities in the emerging areas of technology convergence. M4: Inculcating professional behavior, strong ethical values, leadership abilities, entrepreneurship skills and commitment to lifelong learning. Upon completion of 4 year under graduate program, the student will be able to possess the following outcomes….. PO1: Engineering Knowledge: Apply the knowledge of mathematics, science, engineering fundamentals, and an engineering specialization to the solution of complex engineering problems. PO2: Problem Analysis: Identify, formulate, review research literature, and analyse complex engineering problems reaching substantiated conclusions using first principles of mathematics, natural sciences, and engineering sciences. PO3: Design/Development of solutions: Design solutions for complex engineering problems and design system components or processes that meet the specified needs with appropriate consideration for the public health and safety, and the cultural, societal, and environment considerations. PO4: Conduct investigations of Complex Problems: Use research-based knowledge and research methods including design of experiments analysis and interpretation of data, and synthesis of the information to provide valid conclusions for complex problems. PO5: Modern Tool Usage: create, select, and apply appropriate techniques, resources, and modern engineering and IT tools including prediction and modelling to complex engineering activities with an understanding of the limitations. PO6: The Engineer and Society: Apply reasoning informed by the contextual knowledge to assess societal, health, safety, legal and cultural issues and the consequent responsibilities relevant to the professional engineering practice. PO7: Environment and sustainability: Understand the impact of the professional engineering solutions in societal and environmental contexts, demonstrate the knowledge of, and need for sustainable development. PO8: Ethics: Apply ethical principles and commit to professional ethics, responsibilities and norms of the engineering practice. PO9: Individual Teamwork: Function effectively as an individual, and as a member or leader in diverse teams, and in multi-disciplinary settings. PO10: Communication: Communicate effectively on complex engineering activities with the engineering community and with society, such as, being able to comprehend and write effective reports and design documentation, make effective presentations, and give and receive clear instructions. PO11: Project Management and Finance: Demonstrate"
  },
  {
    "id": "1021784718618014841_2",
    "source_url": "https://tkrcet.ac.in/computer-science-and-engineering/",
    "text": "Ethics: Apply ethical principles and commit to professional ethics, responsibilities and norms of the engineering practice. PO9: Individual Teamwork: Function effectively as an individual, and as a member or leader in diverse teams, and in multi-disciplinary settings. PO10: Communication: Communicate effectively on complex engineering activities with the engineering community and with society, such as, being able to comprehend and write effective reports and design documentation, make effective presentations, and give and receive clear instructions. PO11: Project Management and Finance: Demonstrate knowledge and understanding of the engineering and management principles and apply these to one’s own work, as a member and leader in a team, to manage projects and in multi-disciplinary environments. PO12: Life-long Learning: Recognize the need for, and have the preparation and ability to engage in independent and life-long learning in the broadest context of technological change. PSO1: Developing software applications with key focus on privacy, cost and utility. PSO2: Storing, processing, analysing, communicating the data for effective decision-making while finding solutions for problems. PEO1-Preparation: Develop professional skills for a successful professional career as an engineer, scientist, technocrat, administrator or an entrepreneur. PEO2-Core Competence: Design and implement practical systems consisting of software and/or hardware components through the key principles and practices of computation, mathematics and basic principles of engineering. PEO3-Multidisciplinary: Design and apply new ideas and technologies as the field evolves, to solve real world problems in related interdisciplinary areas. PEO4-Professional Environment: Demonstrate professional attitude and ethics, effective communication, team work and managerial skills for societal, environmental and global context. - Campus Resources - Student Degree Verification - New Student Registration - Income Declaration Form (2024-25) - NCC - NSS - SOP - Achievements - Good Governance Document - Strategic Plan & Program Development Document - Research Policy Document - Ombudsperson - Route Map - Virtual Tour 360 - Service Rules - Online Grievance Cell - B Category / Management Application Form - Feedback(s) - Mandatory Disclosures - Code-of-Conduct - Home"
  },
  {
    "id": "1021784718618014841_3",
    "source_url": "https://tkrcet.ac.in/computer-science-and-engineering/",
    "text": "- Home"
  },
  {
    "id": "4315084571017819712_0",
    "source_url": "https://tkrcet.ac.in/cse-ds-csd/",
    "text": "CSE-DS (CSD) - CSE-DS (CSD) Data Science (Allied with CSE) Dr. V. Krishna Professor & Head Head of the Department The Department was established in the year 2020 with an intake of 60 currently it is 180. This department focuses on teaching students the skills and knowledge necessary to work with and analyze large amounts of data. This includes a combination of programming, statistics, and domain-specific knowledge, such as business or healthcare. DEPARTMENT OF DATA SCIENCE Students in a Data Science Engineering program typically start with a strong foundation in computer programming languages like Python, R, or Java, which are essential for data manipulation and analysis. They also study statistical concepts and methods, such as probability theory, regression analysis, and machine learning algorithms. The Department headed by Dr. V. Krishna having 23 years of teaching experience. He completed his Doctoral degree from Rayalseema University, AP in 2019. With His rich experience in Teaching and Research Guiding the students towards best Data Science engineers in the Industry. - Vision - MISSION - P.O's - PEO's - PSO's The Department endorses to inculcate academic practices that would transform nascent students into Data Scientists with ethical values who could address technical and social Challenges. - To strengthen the students core competency with required rudimentary knowledge. - To inculcate academic practices by developing projects using technology. - To develop entrepreneurial skills, leadership qualities, ethical values and capability to work in a team among the students. A student will be able to - Engineering Knowledge: Apply the knowledge of mathematics, science, engineering fundamentals, and an engineering specialization to the solution of complex engineering problems. - Problem Analysis: Identify, formulate, review research literature, and analyse complex engineering problems reaching substantiated conclusions using first principles of mathematics, natural sciences, and engineering sciences. - Design/Development of Solutions: Design solutions for complex engineering problems and design system components or processes that meet the specified needs with appropriate consideration for the public health and safety, and the cultural, societal, and environmental considerations. - Conduct Investigations of Complex Problems: Use research-based knowledge and research methods including design of experiments, analysis and interpretation of data, and synthesis of the information to provide valid conclusions. - Modern Tool Usage: Create, select, and apply appropriate techniques, resources, and modern engineering and IT tools including prediction and modelling to complex engineering activities with an understanding of the limitations. - The Engineer and Society: Apply reasoning"
  },
  {
    "id": "4315084571017819712_1",
    "source_url": "https://tkrcet.ac.in/cse-ds-csd/",
    "text": "the public health and safety, and the cultural, societal, and environmental considerations. - Conduct Investigations of Complex Problems: Use research-based knowledge and research methods including design of experiments, analysis and interpretation of data, and synthesis of the information to provide valid conclusions. - Modern Tool Usage: Create, select, and apply appropriate techniques, resources, and modern engineering and IT tools including prediction and modelling to complex engineering activities with an understanding of the limitations. - The Engineer and Society: Apply reasoning informed by the contextual knowledge to assess societal, health, safety, legal and cultural issues and the consequent responsibilities relevant to the professional engineering practice. - Environment and Sustain ability: Understand the impact of the professional engineering solutions in societal and environmental contexts, and demonstrate the knowledge of, and need for sustainable development. - Ethics: Apply ethical principles and commit to professional ethics and responsibilities and norms of the engineering practice. - Individual and Team Work: Function effectively as an individual, and as a member or leader in diverse teams, and in multi-disciplinary settings. - Communication: Communicate effectively on complex engineering activities with the engineering community and with society at large, such as, being able to comprehend and write effective reports and design documentation, make effective presentations, and give and receive clear instructions. - Project Management and Finance: Demonstrate knowledge and understanding of the engineering and management principles and apply these to one’s own work, as a member and leader in a team, to manage projects and in multi-disciplinary environments. - Life-long Learning: Recognize the need for, and have the preparation and ability to engage in independent and life-long learning in the broadest context of technological change. - Graduates will be made competent to apply engineering fundamentals and Data Science Knowledge to develop solutions for complex engineering problems. - Graduates will be able to create and apply resources and tools, including predictions to intricate engineering activities and synthesize information to provide valid conclusions. - Graduates will be equipped with adequate technical knowledge, competency in soft skills and learning skills with appropriate considerations for public health safety, environmental sustainability and cultural and societal upliftment. - Graduates will be enabled to use their innovative ideas , entrepreneurial skills managerial and financial skills for enhanced career growth. PSO1: Apply the concepts and practical knowledge in data analytical process of computing systems and Statistical methods to multi-disciplinary problems. PSO2: Demonstrate an understanding of appropriate research"
  },
  {
    "id": "4315084571017819712_2",
    "source_url": "https://tkrcet.ac.in/cse-ds-csd/",
    "text": "valid conclusions. - Graduates will be equipped with adequate technical knowledge, competency in soft skills and learning skills with appropriate considerations for public health safety, environmental sustainability and cultural and societal upliftment. - Graduates will be enabled to use their innovative ideas , entrepreneurial skills managerial and financial skills for enhanced career growth. PSO1: Apply the concepts and practical knowledge in data analytical process of computing systems and Statistical methods to multi-disciplinary problems. PSO2: Demonstrate an understanding of appropriate research methods used to collect and analyze data for decision-making and communications. - Campus Resources - Student Degree Verification - New Student Registration - Income Declaration Form (2024-25) - NCC - NSS - SOP - Achievements - Good Governance Document - Strategic Plan & Program Development Document - Research Policy Document - Ombudsperson - Route Map - Virtual Tour 360 - Service Rules - Online Grievance Cell - B Category / Management Application Form - Feedback(s) - Mandatory Disclosures - Code-of-Conduct - Home"
  }
]